Feature: Включение и выключение пульта

  Scenario: Включение пульта верхняя часть
    When Я повернул рычаг в положение "2"
    Then Горит "APK"
    Then Не горит "VOR"
    Then Не горит "DME"
    Then Не горит "ILS"
    Then Не горит "MLS"
    Then Не горит "RSBN"
    Then Не горит "MRP"
    Then На панели "1" текст "   150,0"
    Then На панели "2" текст "   150,0"
    Then На панели "3" текст "КОМП ТЛФ"

  Scenario: Выключение пульта верхняя часть
    When Я повернул рычаг в положение "0"
    Then Не горит "APK"
    Then Не горит "VOR"
    Then Не горит "DME"
    Then Не горит "ILS"
    Then Не горит "MLS"
    Then Не горит "RSBN"
    Then Не горит "MRP"
    Then На панели "1" текст "        "
    Then На панели "2" текст "        "
    Then На панели "3" текст "        "
