Feature: Включение и выключение пульта

  Scenario: Включение пульта
    When Я повернул рычаг в положение "2"
    Then Горит "APK"
    Then На панели "1" текст "   150,0"
    Then На панели "2" текст "   150,0"
    Then На панели "3" текст "комп тлф"
    Then На панели "4" текст " 118,000"
    Then На панели "5" текст " 118,000"
    Then На панели "6" текст "пш      "
    Then Горит "MB1"

  Scenario: Выключение пульта
    When Я повернул рычаг в положение "0"
    Then Не горит "APK"
    Then На панели "1" текст "        "
    Then На панели "2" текст "        "
    Then На панели "3" текст "        "
    Then На панели "4" текст "        "
    Then На панели "5" текст "        "
    Then На панели "6" текст "        "
    Then Не горит "MB1"
