Feature: Работа с первой тройкой кнопок нижней панели

  Scenario: Работа с первой тройкой кнопок 1
    When Я повернул рычаг в положение "2"
    When Я нажал кнопку "MB2"
    Then На панели "4" текст " 118,000"
    Then На панели "5" текст " 118,000"
    Then На панели "6" текст "ПШ      "
    Then Не горит "MB1"
    Then Горит "MB2"
    Then Не горит "MB3"

  Scenario: Работа с первой тройкой кнопок 2
    When Я повернул рычаг в положение "2"
    When Я нажал кнопку "MB3"
    Then На панели "4" текст "САОД   Д"
    Then На панели "5" текст " 118,000"
    Then На панели "6" текст "САОД   Д"
    Then Не горит "MB1"
    Then Не горит "MB2"
    Then Горит "MB3"
